# Computing Aggregate Statistics

In [1]:
import pandas as pd

In [2]:
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]

In [3]:
GradeList = zip(names,grades,bsdegrees,msdegrees,phddegrees)
df = pd.DataFrame(data=GradeList, columns=['Names','Grades','BS','MS','PhD'])

In [4]:
df

     Names  Grades  BS  MS  PhD
0      Bob      76   1   2    0
1  Jessica      95   1   1    1
2     Mary      77   0   0    0
3     John      78   0   0    0
4      Mel      99   1   0    0

In [6]:
df.median()

Grades    78.0
BS         1.0
MS         0.0
PhD        0.0
dtype: float64

In [8]:
df.var()

Grades    122.5
BS          0.3
MS          0.8
PhD         0.2
dtype: float64

In [9]:
df.mean()

Grades    85.0
BS         0.6
MS         0.6
PhD        0.2
dtype: float64

In [10]:
df.count() # number of values

Names     5
Grades    5
BS        5
MS        5
PhD       5
dtype: int64

In [11]:
df.mean() # arithmetic average

Grades    85.0
BS         0.6
MS         0.6
PhD        0.2
dtype: float64

In [12]:
df.std() # standard deviation

Grades    11.067972
BS         0.547723
MS         0.894427
PhD        0.447214
dtype: float64

In [13]:
df.min() # minimum

Names     Bob
Grades     76
BS          0
MS          0
PhD         0
dtype: object

In [14]:
df.max() # maximum

Names     Mel
Grades     99
BS          1
MS          2
PhD         1
dtype: object

In [15]:
df.quantile(.25) # first quartile

Grades    77.0
BS         0.0
MS         0.0
PhD        0.0
Name: 0.25, dtype: float64

In [16]:
df.quantile(.5) # second quartile

Grades    78.0
BS         1.0
MS         0.0
PhD        0.0
Name: 0.5, dtype: float64

In [17]:
df.quantile(.75)

Grades    95.0
BS         1.0
MS         1.0
PhD        0.0
Name: 0.75, dtype: float64

In [19]:
df.describe()

          Grades        BS        MS       PhD
count   5.000000  5.000000  5.000000  5.000000
mean   85.000000  0.600000  0.600000  0.200000
std    11.067972  0.547723  0.894427  0.447214
min    76.000000  0.000000  0.000000  0.000000
25%    77.000000  0.000000  0.000000  0.000000
50%    78.000000  1.000000  0.000000  0.000000
75%    95.000000  1.000000  1.000000  0.000000
max    99.000000  1.000000  2.000000  1.000000